.emacs.d/init.org
#+title: emacs configuration
#+property: header-args:emacs-lisp :tangle ./init.el :mkdirp yes
#+options: num:nil
#+html_head <link rel="stylesheet" type"text/css" href=""/>
* emacs install
#+begin_src shell
  sudo apt update
  sudo apt upgrade -y && sudo apt autoremove -y
  sudo apt-get install libutils
  sudo apt-get install ubuntu-desktop
  sudo apt-get install indicator-appmenu-tools
  ./configure --with-native-compilation --with-mailutils
  sudo apt install libtool-bin #vterm설치용
  sudo apt install compton  #스크롤 부드럽게
  sudo apt install feh #백그라운드 설정
  sudo apt install arandr #해상도 조절
  sudo apt install scrot brightnessctl playerctl #스크린샷, 밝기컨트롤, 오디오 컨트롤
  sudo apt install blueman pasystray pavucontrol #bt컨트롤
  sudo apt install slock xss-lock #화면잠금
  sudo apt install xsel #클립보드 복사 $xsel --clipboard < sadf.txt  반대는 > text.txt
  sudo apt install autorandr #display연결등의 변경을 감지
  sudo apt-get install nabi
  im-config -s nabi
  emacs -q -nw #cmd로 실행
#+end_src
.xprofile .xinitrc.exwm
#+begin_src shell
export XIM=nabi
export XIM_ARGS=
export XIM_PROGRAM="nabi"
export XMODIFIERS="@im=nabi"
export ENCORE_IMF_MODULE=xim
export GTK_IM_MODULE=xim
export GTK_TM_MODULE=xim
export GTK3_IM_MODULE=xim
export QT_IM_MODULE=xim
export QT_TM_MODULE=xim
export QT4_IM_MODULE=xim
export QT5_IM_MODULE=xim
export CLUTTER_IM_MODULE=xim
LANG=ko_KR.UTF8 nabi &
#+end_src

* basic shortcut
** 자주 쓰는 단축키
|----------------------+----------------------------|
| 명령어               | 단축키                     |
|----------------------+----------------------------|
| 텍스트 크기조절      | c-x c-0 누른 후 + 하거나 - |
|----------------------+----------------------------|
| 한줄실행             | c-x c-e                    |
|----------------------+----------------------------|
| 바로 실행            | m-: eval                   |
|----------------------+----------------------------|
| 명령어 찾기          | m-x                        |
|----------------------+----------------------------|
| 현재 단어 하이라이트 | m-s h .                    |
|----------------------+----------------------------|
| 정규식 하이라이트    | m-s h r                    |
|----------------------+----------------------------|
| 하이라이트 삭제      | m-s h u                    |
|----------------------+----------------------------|
| 파일 북마크 추가     | c-x r m                    |
|----------------------+----------------------------|
| bookmark jump        | c-x r b                    |
|----------------------+----------------------------|
| list bookmark        | c-x r l                    |
|----------------------+----------------------------|
| emacs 종료           | C-x C-c                    |
|----------------------+----------------------------|
| org export           | C-c C-e h h                |
|----------------------+----------------------------|
| async shell          | M-&                        |
|----------------------+----------------------------|
| async shell          | win-&                      |
|----------------------+----------------------------|
| focus switch buff    | C-x w number               |
|----------------------+----------------------------|
| Org show images      | C-c C-x C-v                |
|----------------------+----------------------------|
| Symbol rename        | M-s . -> C-M-% -> !        |
|----------------------+----------------------------|
| Evil-emacs-state     | C-z                        |
|----------------------+----------------------------|
| timer                | C-c C-x ;                  |
|----------------------+----------------------------|
  rename-file
  M-x check-parens : init.el디버깅 괄호 틀린지
  describe-bindings =C-h b=
  describe-variable =C-h v=
  describe-function =C-h f=
  M-x proced =x= send signal
  (start-process-shell-command "tool" nil "vim ~/test.txt") : 비동기로 출력없이 실행

** dired 사용법
- =C-x d= 가 단축키
  =dired-listing-switches= : -al 기본이 ls -al 처럼 보이니 이걸 바꾸면 됨
  =C-x C-j= 바로 현재창에 dired 띄우기
  ^ : 상위 디렉토리로 이동
  J : 파일이름 검색해서 이동
  RET : 파일이나 디렉토리 열기
  M-RET : 다른 창에서 열기 S-RET 는 열고 포커스는 이동안함
  go : 프리뷰 모드로 esc하면 창 닫고 돌아감
  q : dired buffer bury
  gy : file type
  =gr : buffer refresh=
  M : chmod
  O : chown
  gG : change the group
  L : load an emacs lisp into emacs
  =C : copy=
  = : dired diff
  =+ : create a directory=
  =D : delete=
  =R : rename / move=
  C-x C-q : vim 모드로 여러파일 이름 변화후 Z Z 하면 저장됨, 
  S : symlinc
  H : hardlink
  Z : do compress/decompress tar.gz
  c : compress selection to a specific file
  X : do shell command =!=
  =m : mark=
  =u : unmark=
  U : unmark all
  t : invert mark
  * : options
  */ : select directories
  %m : regex mark
  & : dired-do-async-shell-command
  C-ret : open with external
  
* basic configuration
** clean up emacs user interface, make it minimal.

#+begin_src emacs-lisp
  ;; -*- lexical-binding: t; -*-
  (setq inhibit-startup-message t)
 
  ;(unless dw/is-termux
  (scroll-bar-mode -1)        ; disable visible scrollbar
  (tool-bar-mode -1)          ; disable the toolbar
  (tooltip-mode -1)           ; disable tooltips
  (set-fringe-mode 10)       ; give some breathing room
 
  (menu-bar-mode -1)            ; disable the menu bar
 
  ;; set up the visible bell
  (setq visible-bell nil)
  (setq ring-bell-function 'ignore)
 
  ;; adjust font size 
  (defvar efs/default-font-size 180) ; macos
  ;(defvar efs/default-font-size 135) ;gumi linux
 
  ;; set frame transparency
  (set-frame-parameter (selected-frame) 'alpha '(90 . 90))
  (add-to-list 'default-frame-alist '(alpha . (90 . 90)))
  (set-frame-parameter (selected-frame) 'fullscreen 'maximized)
  (add-to-list 'default-frame-alist '(fullscreen . maximized))
  (if (eq system-type 'darwin)
      (setenv "LIBRARY_PATH" "/opt/homebrew/opt/gcc/lib/gcc/11:/opt/homebrew/opt/libgccjit/lib/gcc/11:/opt/homebrew/opt/gcc/lib/gcc/11/gc\
 /aarch64-apple-darwin21/11:/Library/Developer/CommandLineTools/SDKs/MacOSX.sdk/usr/lib"))
  (if (eq system-type 'darwin)
      (setenv "LD_lIBRARY_PATH" "/opt/homebrew/opt/gcc/lib/gcc/11:/opt/homebrew/opt/libgccjit/lib/gcc/11:/opt/homebrew/opt/gcc/lib/gcc/11/gc\
 /aarch64-apple-darwin21/11:/Library/Developer/CommandLineTools/SDKs/MacOSX.sdk/usr/lib"))
  (if (eq system-type 'darwin)
       (add-to-list 'exec-path "/opt/homebrew/bin"))
#+end_src

 - auto-package-update-now #이걸로 바로 가능함
#+begin_src emacs-lisp
(use-package auto-package-update
  :custom
  (auto-package-update-interval 7)
  (auto-package-update-prompt-before-update t)
  (auto-package-update-hide-results t)
  :config
  (auto-package-update-maybe)
  (auto-package-update-at-time "09:00"))
#+end_src
** package setup

- use-package는
  ensure t은 package가 로컬에 없을때 다운로드 하게함
  init은 패키지 로드 전 실행랄 코드
  command 는 autoload명령으로 init과 config사이 동작
  config는 패키지 로드 후 실행할 내용
  bind는 m-x describe-personal-keybinding 에 키 바인딩 적재 시킴
  이것과 동일하게 일을 시키는건 아래와 같음
   init
   (bind-key "c-." 'ace-jumbp-mode))
  bind-keymap은 비슷한데 그 패키지에 정의된 keymap만 사용가능

#+begin_src emacs-lisp
  (require 'package)

  (setq package-archives '(("melpa" . "https://melpa.org/packages/")
                           ("org" . "https://orgmode.org/elpa/")
                           ("elpa" . "https://elpa.gnu.org/packages/")))
  ;; fix an issue accessing the elpa archive in termux
  ;(when dw/is-termux
  ;  (setq gnutls-algorithm-priority "normal:-vers-tls1.3"))

  (package-initialize)
  (unless package-archive-contents
    (package-refresh-contents))

  ;; initialize use-package on non-linux platforms
  (unless (package-installed-p 'use-package)
     (package-install 'use-package))
  (require 'use-package)

  ;; uncomment this to get a reading on packages that get loaded at startup
  ;;(setq use-package-verbose t)

  ;; on non-guix systems, "ensure" packages by default
  (setq use-package-always-ensure t)
#+end_src

** Keep folders Clean
파일을 수정 후 저장하면 최초 버퍼 열었을때 파일을 ~를 붙여서 백업하기
https://github.com/emacscollective/no-littering
#+begin_src emacs-lisp
  ;.emacs.d에다가 tmp만들어서 거기 다 백업
  ;(setq backup-directory-alist '(("." . ,(expand-file-name "tmp/backups/" user-emacs-directory))))
  ;모든 백업을 끌때
  (setq make-backup-files nil)
  
  ;https://github.com/emacscollective/no-littering
  ;패키지들이 잡다하게 만드는 파일들의 위치를 정리해줌
  (use-package no-littering)
#+end_src

#+RESULTS:

** Auto save move
저장안한 파일에 #붙어 자동 저장되는것
http://www.gnu.org/software/emacs/manual/html_node/emacs/Auto-Save-Files.html#Auto-Save-Files
#+begin_src emacs-lisp
  ; 폴더 없으면 생기게 하고
  (make-directory (expand-file-name "tmp/auto-saves/" user-emacs-directory) t)
  
  (setq auto-save-list-file-prefix (expand-file-name "tmp/auto-saves/sessions/" user-emacs-directory)
        auto-save-file-name-transforms `((".*" ,(expand-file-name "tmp/auto-saves/" user-emacs-directory) t)))
#+end_src

** Lock Files
파일을 열고 수정한 상태로 있으면 lock을 함  .#Emacs.org처럼
#+begin_src emacs-lisp
;(setq create-lockfiles nil)
#+end_src


** custom packages

#+begin_src emacs-lisp
  (custom-set-variables
   '(package-selected-packages
     '(evil-magit magit ag rg ripgrep hydra evil-collection undo-tree evil general all-the-icons-dired doom-modeline marginalia vertico command-log-mode use-package)))
  (custom-set-faces
   )
#+end_src

* interface settings
** set font 

#+begin_src emacs-lisp
(defun efs/set-font-faces ()
  (message "Setting faces!")
  (if (eq system-type 'darwin)
     (set-face-attribute 'default nil :family "d2coding" :height 175)) ;macbook
  (if (eq system-type 'gnu/linux)
     (set-face-attribute 'default nil :family "d2coding" :height 135)) ;linux
  (setq default-input-method "korean-hangul")
  (set-fontset-font t 'hangul (font-spec :name "d2coding"))
  (global-set-key (kbd "S-SPC") 'toggle-input-method))

(if (daemonp)
    (add-hook 'after-make-frame-functions
              (lambda (frame)
                (setq doom-modeline-icon t)
                (with-selected-frame frame
                  (efs/set-font-faces))))
    (efs/set-font-faces))
#+end_src

** line number

#+begin_src emacs-lisp
  (column-number-mode) 
  (global-display-line-numbers-mode t) ;t 는 시작시 묻지말고 셋하라는 의미
  (setq display-line-numbers-type 'relative)
  ;; enable line numbers for some modes
  (dolist (mode '(term-mode-hook
                  eshell-mode-hook
                  vterm-mode-hook
                  treemacs-mode-hook
                  shell-mode-hook))
    (add-hook mode (lambda () (display-line-numbers-mode 0))))
  (dolist (mode '(text-mode-hook
                  prog-mode-hook
                  conf-mode-hook))
    (add-hook mode (lambda () (display-line-numbers-mode 1))))
#+end_src

** mode line

#+begin_src emacs-lisp
  (use-package doom-modeline)
  (doom-modeline-mode 1)

  (use-package all-the-icons
    :if (display-graphic-p)
    :commands all-the-icons-install-fonts
    :init
    (unless (find-font (font-spec :name "all-the-icons"))
      (all-the-icons-install-fonts t)))


  (use-package doom-modeline
    :ensure t
    :init (doom-modeline-mode 1)
    :custom (doom-modeline-height 15))
#+end_src

** Theme

#+begin_src emacs-lisp
  (use-package doom-themes)
  (load-theme 'doom-gruvbox 1)
#+end_src

