.emacs.d/init.el
;; -*- lexical-binding: t; -*-
 (setq inhibit-startup-message t)

 ;(unless dw/is-termux
 (scroll-bar-mode -1)        ; disable visible scrollbar
 (tool-bar-mode -1)          ; disable the toolbar
 (tooltip-mode -1)           ; disable tooltips
 (set-fringe-mode 10)       ; give some breathing room

 (menu-bar-mode -1)            ; disable the menu bar

 ;; set up the visible bell
 (setq visible-bell nil)
 (setq ring-bell-function 'ignore)

 ;; adjust font size 
 (defvar efs/default-font-size 180)

 ;; set frame transparency
 (set-frame-parameter (selected-frame) 'alpha '(90 . 90))
 (add-to-list 'default-frame-alist '(alpha . (90 . 90)))
 (set-frame-parameter (selected-frame) 'fullscreen 'maximized)
 (add-to-list 'default-frame-alist '(fullscreen . maximized))
 (if (eq system-type 'darwin)
     (setenv "LIBRARY_PATH" "/opt/homebrew/opt/gcc/lib/gcc/11:/opt/homebrew/opt/libgccjit/lib/gcc/11:/opt/homebrew/opt/gcc/lib/gcc/11/gc\
/aarch64-apple-darwin21/11:/Library/Developer/CommandLineTools/SDKs/MacOSX.sdk/usr/lib"))
 (if (eq system-type 'darwin)
     (setenv "LD_lIBRARY_PATH" "/opt/homebrew/opt/gcc/lib/gcc/11:/opt/homebrew/opt/libgccjit/lib/gcc/11:/opt/homebrew/opt/gcc/lib/gcc/11/gc\
/aarch64-apple-darwin21/11:/Library/Developer/CommandLineTools/SDKs/MacOSX.sdk/usr/lib"))
 (if (eq system-type 'darwin)
      (add-to-list 'exec-path "/opt/homebrew/bin"))

(use-package auto-package-update
  :custom
  (auto-package-update-interval 7)
  (auto-package-update-prompt-before-update t)
  (auto-package-update-hide-results t)
  :config
  (auto-package-update-maybe)
  (auto-package-update-at-time "09:00"))

(require 'package)

(setq package-archives '(("melpa" . "https://melpa.org/packages/")
                         ("org" . "https://orgmode.org/elpa/")
                         ("elpa" . "https://elpa.gnu.org/packages/")))
;; fix an issue accessing the elpa archive in termux
;(when dw/is-termux
;  (setq gnutls-algorithm-priority "normal:-vers-tls1.3"))

(package-initialize)
(unless package-archive-contents
  (package-refresh-contents))

;; initialize use-package on non-linux platforms
(unless (package-installed-p 'use-package)
   (package-install 'use-package))
(require 'use-package)

;; uncomment this to get a reading on packages that get loaded at startup
;;(setq use-package-verbose t)

;; on non-guix systems, "ensure" packages by default
(setq use-package-always-ensure t)

;.emacs.d에다가 tmp만들어서 거기 다 백업
;(setq backup-directory-alist '(("." . ,(expand-file-name "tmp/backups/" user-emacs-directory))))
;모든 백업을 끌때
(setq make-backup-files nil)

;https://github.com/emacscollective/no-littering
;패키지들이 잡다하게 만드는 파일들의 위치를 정리해줌
(use-package no-littering)

; 폴더 없으면 생기게 하고
(make-directory (expand-file-name "tmp/auto-saves/" user-emacs-directory) t)

(setq auto-save-list-file-prefix (expand-file-name "tmp/auto-saves/sessions/" user-emacs-directory)
      auto-save-file-name-transforms `((".*" ,(expand-file-name "tmp/auto-saves/" user-emacs-directory) t)))

;(setq create-lockfiles nil)

(custom-set-variables
 '(package-selected-packages
   '(evil-magit magit ag rg ripgrep hydra evil-collection undo-tree evil general all-the-icons-dired doom-modeline marginalia vertico command-log-mode use-package)))
(custom-set-faces
 )

(defun efs/set-font-faces ()
  (message "Setting faces!")
  (if (eq system-type 'darwin)
     (set-face-attribute 'default nil :family "d2coding" :height 175)) ;macbook
  (if (eq system-type 'gnu/linux)
     (set-face-attribute 'default nil :family "d2coding" :height 135)) ;linux
  (setq default-input-method "korean-hangul")
  (set-fontset-font t 'hangul (font-spec :name "d2coding"))
  (global-set-key (kbd "S-SPC") 'toggle-input-method))

(if (daemonp)
    (add-hook 'after-make-frame-functions
              (lambda (frame)
                (setq doom-modeline-icon t)
                (with-selected-frame frame
                  (efs/set-font-faces))))
    (efs/set-font-faces))

(column-number-mode) 
(global-display-line-numbers-mode t) ;t 는 시작시 묻지말고 셋하라는 의미
(setq display-line-numbers-type 'relative)
;; enable line numbers for some modes
(dolist (mode '(term-mode-hook
                eshell-mode-hook
                vterm-mode-hook
                treemacs-mode-hook
                shell-mode-hook))
  (add-hook mode (lambda () (display-line-numbers-mode 0))))
(dolist (mode '(text-mode-hook
                prog-mode-hook
                conf-mode-hook))
  (add-hook mode (lambda () (display-line-numbers-mode 1))))

(use-package doom-modeline)
(doom-modeline-mode 1)

(use-package all-the-icons
  :if (display-graphic-p)
  :commands all-the-icons-install-fonts
  :init
  (unless (find-font (font-spec :name "all-the-icons"))
    (all-the-icons-install-fonts t)))


(use-package doom-modeline
  :ensure t
  :init (doom-modeline-mode 1)
  :custom (doom-modeline-height 15))

(use-package doom-themes)
(load-theme 'doom-gruvbox 1)
