.emacs.d/init.org
** Delimiter

#+begin_src emacs-lisp
  (use-package  rainbow-delimiters
    :hook (prog-mode . rainbow-delimiters-mode))
#+end_src

** Helpful functions

#+begin_src emacs-lisp
  (use-package  which-key
    :init (which-key-mode)
    :diminish which-key-mode
    :config
    (setq which-key-idle-delay 0.5))

  (use-package helpful
    :custom
    (counsel-describe-function-function #'helpful-callable)
    (counsel-describe-variable-function #'helpful-variable)
    :bind
    ([remap describe-function] . helpful-function)
    ([remap describe-symbol] . helpful-symbol)
    ([remap describe-variable] . helpful-variable)
    ([remap describe-command] . helpful-command)
    ([remap describe-key] . helpful-key))

  (global-set-key (kbd "<escape>") 'keyboard-escape-quit)
#+end_src

** Key settings

#+begin_src emacs-lisp
(use-package general
  :config
  (general-evil-setup t)
  (general-create-definer my/leader-keys
    :keymaps '(normal insert visual emacs)
    ;:prefix "C-M"
    :global-prefix "C-SPC"))
  ;(my/leader-keys
  ; "ts" '(load-theme :which-key "choose theme")))

(use-package undo-tree
  :init
  (setq undo-tree-auto-save-history nil)
  (global-undo-tree-mode 1))
#+end_src

** Evil Mode

#+begin_src emacs-lisp
  (use-package evil
    ;; Pre-load configuration
    :init
    (setq evil-want-integration t)
    (setq evil-want-keybinding nil)
    (setq evil-want-C-u-scroll t)
    (setq evil-want-C-i-jump nil)
    (setq evil-respect-visual-line-mode t)
    (setq evil-undo-system 'undo-tree)
  
    :config
    ;; Activate the Evil
    (evil-mode 1)
  
    ;; Set Emacs state modes
    (define-key evil-insert-state-map (kbd "C-g") 'evil-normal-state)
    (define-key evil-insert-state-map (kbd "C-h") 'evil-delete-backward-char-and-join)
  
    ;; Use visual line motions even outside of visual-line-mode buffers
    (evil-global-set-key 'motion "j" 'evil-next-visual-line)
    (evil-global-set-key 'motion "k" 'evil-previous-visual-line)
  
    (evil-set-initial-state 'messages-buffer-mode 'normal)
    (evil-set-initial-state 'dashboard-mode 'normal))
  ;ysiw 한담에 ' 하면 해당단어 ''로 서라운드
  ;ds 는 지우기
  ;cs 는 바꾸기
  ;선택한담에 S하면 선택한부분 surround
  (use-package evil-surround
    :ensure t
    :config
    (global-evil-surround-mode 1))
  (use-package evil-visualstar
    :ensure t
    :config
    (global-evil-visualstar-mode t))
  
  (use-package evil-collection
    :after evil
    :config
    (evil-collection-init))
  
  ;evil에서 심볼단위 검색 가능하도록 언더바 있으면 선택 안되던 문제 해결
  (with-eval-after-load 'evil
    (defalias #'forward-evil-word #'forward-evil-symbol)
    ;; make evil-search-word look for symbol rather than word boundaries
    (setq-default evil-symbol-word-search t))
  
  ;선택 영역 단어 변경 vim스타일
  (defun evilcvn-change-symbol-in-defun ()
    "use string replacing UI in evil-mode to replace the symbol under cursor"
    (interactive)
    (let ((old (thing-at-point 'symbol)))
      (evil-ex (concat "%s/" (if (= 0 (length old)) "" "") old (if (= 0 (length old)) "" "/"))))
    )
  (global-set-key (kbd "M-s M-s") 'evilcvn-change-symbol-in-defun)
#+end_src

#+RESULTS:
| (lambda nil (setq evil-input-method nil)) | evil-maybe-expand-abbrev | evil-stop-track-last-insertion | evil-cleanup-insert-state | doom-modeline-update-buffer-file-name |

  - =dired-listing-switches:= try =-agho --group-directories-first= 디렉토리 후 파일 보이게 하는것
  - dired single : dired buffer를 하나로 관리  
  - 특정 확장자를 emacs가 아닌 다른 프로그램으로 열어서 exwm이 열게도 가능\
  - mupdf 관련세팅 https://www.romanzolatarev.com/xdg-mime.html

#+begin_src emacs-lisp
  ;mac built in ls does not support group-directories-first
  ;so brew install coreutils first
  (if (eq system-type 'darwin)
      (setq insert-directory-program "gls" dired-use-ls-dired t))
  (use-package dired-single)
  (use-package dired
    :ensure nil ;use-package가 install 안하게 함.
    :commands (dired dired-jump)
    :bind (("C-x C-j" . dired-jump))
    :custom ((dired-listing-switches "-al --group-directories-first"))
    :config
    (evil-collection-define-key 'normal 'dired-mode-map
      "h" 'dired-single-up-directory
      "l" 'dired-single-buffer))
  (use-package all-the-icons-dired
    :if (display-graphic-p)
    :hook (dired-mode . all-the-icons-dired-mode))
  ;png파일은 feh라는 툴로 열고...
  (use-package dired-open
    :config
    (setq dired-open-extensions '(("png" . "feh")
                                  ("mkv" . "mpv"))))
  ;hide dot files
  (use-package dired-hide-dotfiles
    :hook (dired-mode . dired-hide-dotfiles-mode)
    :config
    (evil-collection-define-key 'normal 'dired-mode-map
      "H" 'dired-hide-dotfiles-mode))
  (defun mu-open-in-external-app ()
    "Open the file where point is or the marked files in Dired in external
    app. The app is chosen from your OS's preference."
    (interactive)
    (let* ((file-list
	    (dired-get-marked-files)))
     (mapc
      (lambda (file-path)
       (let ((process-connection-type nil))
	(start-process "" nil "xdg-open" file-path))) file-list)))
  (define-key dired-mode-map (kbd "C-<return>") #'mu-open-in-external-app)
#+end_src

** easy motion
#+begin_src emacs-lisp

    ;;easymotion C-'를 트리거로 설정
    (use-package avy)
    (evil-define-key '(normal visual) 'global
     "," #'avy-goto-char-2)
#+end_src

** evil mc 멀티커서
#+begin_src emacs-lisp
 ;;evil-multiedit 힐스너 버전
 ;(use-package evil-multiedit)
 ;(evil-multiedit-default-keybinds)
 ;(use-package evil-mc)
 ;(global-evil-mc-mode 1)
 ;; evil-mc
 ;(evil-define-key '(normal visual) 'global
 ;  "gzm" #'evil-mc-make-all-cursors
 ;  "gzu" #'evil-mc-undo-all-cursors
 ;  "gzz" #'+evil/mc-toggle-cursors
 ;  "gzc" #'+evil/mc-make-cursor-here
 ;  "gzn" #'evil-mc-make-and-goto-next-cursor
 ;  "gzp" #'evil-mc-make-and-goto-prev-cursor
 ;  "gzN" #'evil-mc-make-and-goto-last-cursor
 ;  "gzP" #'evil-mc-make-and-goto-first-cursor)
 ; (with-eval-after-load 'evil-mc
 ;   (evil-define-key '(normal visual) evil-mc-key-map
 ;     (kbd "C-n") #'evil-mc-make-and-goto-next-cursor
 ;     (kbd "C-N") #'evil-mc-make-and-goto-last-cursor
 ;     (kbd "C-p") #'evil-mc-make-and-goto-prev-cursor
 ;     (kbd "C-P") #'evil-mc-make-and-goto-first-cursor))
#+end_src

* Completion System
** Vertico

#+begin_src emacs-lisp
  (use-package vertico
    :ensure t
    :bind (:map vertico-map
                ("C-j" . vertico-next)
                ("C-k" . vertico-previous)
                ("C-f" . vertico-exit)
                :map minibuffer-local-map
                ("M-h" . backward-kill-word))
    :custom
    (vertico-cycle t)
    :init
    (vertico-mode))

  (use-package savehist
    :init
    (savehist-mode))

  (use-package marginalia
    :after vertico
    :custom
    (marginalia-annotators '(marginalia-annotators-heavy marginalia-annotators-light nil))
    :init
    (marginalia-mode))

#+end_src

* Coding Environment
** Projectile

- .projectile파일을 폴더에 넣으면 프로젝트로 인식함 .git이 있어도 됨
- 모든 프로젝타일 키를 =C-c p= 로 트리거하겠다
- =C-c p f= 이후 =M-o= 하면 메뉴가 많아지는데 스크롤 방법을 모름.
- counsel-projectil-rg =C-c p s r=
- projectile-discover-projects-in-search-path
- setq projectile-discover-projects-in-search-path '("~/workspace" "/media/test"))


#+begin_src emacs-lisp
  ;https://youtu.be/INTu30BHZGk
  (use-package projectile
    :diminish projectile-mode
    :config (projectile-mode)
    :custom ((projectile-completion-system 'ivy))
    :bind-keymap
    ("C-c p" . projectile-command-map) ;;모든 프로젝타일 키를 C-c p 로 트리거하겠다
    :init
    (when (file-directory-p "~/workspace")
      (setq projectile-project-search-path '("~/workspace")))
    (setq projectile-switch-project-action #'projectile-dired)
    :bind
    ("C-s" . projectile-ripgrep))
  
  ;C-c p f이후 M-o하면 메뉴가 많아지는데 스크롤 방법을 모름.
  ;counsel-projectil-rg = c-p-s-r
  (use-package counsel-projectile
    :config (counsel-projectile-mode))
  
#+end_src

** Commenting
- M-; 가 기본 emacs comment 설정인데 선택 없을시 좀 이상하게 동작함
- 그래서 요거 써서 =M-/= 로 하면 됨


#+begin_src emacs-lisp
  (use-package evil-nerd-commenter
  :bind ("M-/" . evilnc-comment-or-uncomment-lines))
#+end_src

** Language Modes
*** c-mode
- 컴파일 C-c p P : g++ -g -o hello hello.cpp && ./hello
#+begin_src emacs-lisp
  (use-package c-mode
    :ensure nil
    :hook (c-mode . lsp-deferred) ;c mode켤때 lsp모드 켬
  )
  (use-package c++-mode
    :ensure nil
    :hook (c-mode . lsp-deferred) ;cpp mode켤때 lsp모드 켬
  )
#+end_src
