.emacs.d/init.org
*** python-mode

- ensure nil의 의미는 use-package가 python-mode를 인스톨 하지 않게 함.
- python실행이 python3을 쓰게 함
- hook 으로 python-mode에 들어오면 lsp mode사용하게 함
- C-c p P : pytest -s -v
- C-c p P : pytest -s -v unittests/test_get_tankdump.py
- C-c p P : pytest -s -v -k test_function_name
- C-c p P : cd utopia_preprocess&&pytest -s -v -k test_function_name
  -s : print문 보이게 함
  -v : 더 디테일한 정보
  -k : test_뒤에 있는 이름 기반으로 테스트
  -x : fail시 멈춤


#+begin_src emacs-lisp
  (use-package python-mode
    :ensure nil
    ;:hook (python-mode . lsp-deferred) ;python mode켤때 lsp모드 켬
    :custom
    (python-shell-interpreter "python3")
    (dap-python-excutable "python3")
    (dap-python-debugger 'debugpy)
    :config
    (require 'dap-python)
  )
  ;lsp mode to pyright
  (use-package lsp-pyright
  :ensure t
  :hook (python-mode . (lambda ()
                          (require 'lsp-pyright)
                          (lsp))))

  ;Feel free to throuw your wown personal keybindings here
  ;(map! :leader :desc "Blacken Buffer" "m b b" #'python-black-buffer)
  ;(map! :leader :desc "Blacken Region" "m b r" #'python-black-region)
  ;(map! :leader :desc "Blacken Statement" "m b s" #'python-black-statement)
  (use-package python-black
    :ensure t
    :after python
    :hook (python-mode . python-black-on-save-mode-enable-dwim))
#+end_src

#+RESULTS:
| evil-collection-python-set-evil-shift-width | lsp-deferred | doom-modeline-env-setup-python |

Commands:
- Interactive Python shell: =M-x run-python= (C-c C-p or g z in evil-mode)
- python-shell-send-region =C-c C-r=
  : 다른 버퍼에 run-python실행하고, 이 버퍼에서 영역 산택후 send-region하면 python interpreter에서 실행됨
- python-shell-send-buffer =C-c C-c=
  : 버퍼내용을 통채로 넘겨서 실행함
- python-shell-send-file =C-c C-l=
  : 파일내용을 통채로 넘겨서 실행함
**** python virtual env
- pyvenv-activate 요걸로 파일 열기 전에 venv 선택할 수 있음
- pyvenv-deactivate
- .dir-locals.el
  ((nil . ((pyvenv-activate . "~/.venv"))))
  : eval: (getenv "VIRTUAL_ENV") 하면 설정된 path가 보임

#+begin_src emacs-lisp
  (use-package pyvenv
  :config
  (pyvenv-mode 1))
#+end_src

*** TypeScript
#+begin_src emacs-lisp
(use-package typescript-mode
  :mode "\\.ts\\'"
  :hook (typescript-mode . lsp-deferred)
  :config
  (setq typescript-indent-level 2))
#+end_src

*** Rope
- traad3 is a python refactoring server
#+begin_src emacs-lisp
  (use-package traad)
  (setq traad-environment-name "traad3")
  (setq venv-location "/home/hongiee/python3env/")
  ;(traad-install-server)
#+end_src

** lsp-mode
- yas-new-snippet
 : ./.emacs.d/snippet/org-mode/code
- M-x yas-new-snippet 하고 끝날때는 C-x C-s 로 저장
  
 $0 이 마지막 위치
 $1{:hint}

 지정된 mode에서 단축어 누르고 tab누르면 실행됨
 <code-emacs 하고 탭
 <code-python 하고 탭
 <code-cpp 하고 탭

 
#+begin_src emacs-lisp
  (use-package yasnippet
    :ensure t
    :config
    (setq yas-snippet-dirs'("~/.emacs.d/snippets"))
    (yas-global-mode 1))
#+end_src
- 기본 키는 window - l 같은 키여서 =C-c l= 로 바꿈
- completion-at-point 를 잘 사용하자 C-down + ivy


#+begin_src emacs-lisp
  (defun efs/lsp-mode-setup()
    (setq lsp-headerline-breadcrumb-segments '(path-up-to-project file symbols))
    (lsp-headerline-breadcrumb-mode)) ;위에 경로 보여주기

  (use-package lsp-mode
    :commands (lsp lsp-deferred)
    :hook (lsp-mode . efs/lsp-mode-setup)
    :init
    (setq lsp-keymap-prefix "C-c l")
    (setq lsp-idle-delay 0.3)
    :config
    (lsp-enable-which-key-integration t))

#+end_src

*** flymake 
- flymake-show-diagnostics-buffer : error, warning진단을 보여줌
  flycheck-list-errors ; flymake 동일
  #+begin_src emacs-lisp
(use-package flymake-diagnostic-at-point
  ;:after flymake
  :config
  (add-hook 'flymake-mode-hook #'flymake-diagnostic-at-point-mode))
;(use-package flycheck
;  :ensure t
;  :init (global-flycheck-mode))

  #+end_src

  
*** lsp with python-mode

- lsp-find-defenition =C-c l g g=
- lsp-find-reference =C-c l g r= C-j, C-k로 위아래
- lsp-rename =C-c l r r=
- lsp-format-buffer =C-c l = == ;default = flake8
- lsp-format-region =C-c l = r=
- python lsp-mode
  =M-x eshell=
#+begin_src shell
  pip install 'python-lsp-server[all]'
  pip install 'pyright'
  pip install 'pytest'
  pip install 'debugpy'
#+end_src
- projectile-test-project "pytest" 라는 명령으로 테스트 하도록
  그 버퍼에서 g r 누르면 다시 테스트함(evil mode인경우)
  다른 버퍼면 M-x recompile 커맨드 누름 됨

*** lsp with typescript

#+begin_src shell
npm i -g typescript-language-server; npm i -g typescript
#+end_src


*** Company Mode

- company mode는 completion-at-point보다 보기 좋게 만들어줌
- tab이 선택을 의미하게 만듬. 글자가 없을때 tab은 인덴트를 의미하게도 만듬
- 최소 1자이상 그리고 바로 팝업 발생하게 만듬
- company-mode시작하면 company-box-mode도 시작하게 훅을 해둠

#+begin_src emacs-lisp
(use-package company
  :after lsp-mode
  :hook (lsp-mode . company-mode)
  :bind (:map company-active-map
         ("<tab>" . company-complete-selection))
        (:map lsp-mode-map
         ("<tab>" . company-indent-or-complete-common))
  :custom
  (company-minimum-prefix-length 1)
  (company-idle-delay 0.5))

(use-package company-box
  :hook (company-mode . company-box-mode))
#+end_src

*** lsp-ui

- 조금더 IDE처럼 만들어줌 doc string을 보여주기도 하고
- https://github.com/emacs-lsp/lsp-ui
- lsp-ui-doc-focus-frame 하면 그곳에 포커스가 가고 하면 빠져나옴
- lsp-ui-doc-unfocus-frame 하면 빠져나옴

- lsp-ui-peek-find-defenition (C-c l G g)
- lsp-ui-peek-find-reference (C-c l G r) C-n, C-p로 위아래
  단점은 버퍼를 많이 열어둠

#+begin_src emacs-lisp
(use-package lsp-ui
  :hook (lsp-mode . lsp-ui-mode))
;:custom
;(lsp-ui-doc-position 'bottom))
#+end_src

***  lsp treemacs
- nerd tree같이 보여줌
- lsp-treemacs-symbols : symbol들을 nerd tree처럼 보여줌
- lsp-treemacs-references
- treemacs
#+begin_src emacs-lisp
(use-package lsp-treemacs
  :after lsp)
(use-package treemacs-projectile)
#+end_src

*** pytest
- pytest를 우선 설치
- M-x =projectile-test-project=
  : 이거 입력하면 어떤 테스트 커맨드 할지 물어봄(기본값은 projectile-project-test-cmd로 변경가능)
  : python -m unittest discover
  : 끝나고 해당버퍼에서 r누르면(evil-mode)일때, 다른 버파일때는 M-x recompile하면 됨.
- 묻지않고 테스트 하게끔 하는법
  : add-dir-local-variable -> python-mode -> projectile-project-test-cmd -> "pytest" 이렇게 하면 해당 디렉토리 파이썬 파일 열때 저 명령어 쓸지  물어봄 Envl: (setq compilation-read-command nil) 까지 해주면 test시 묻지않고 실행
 
*** lsp ivy
- symbol 을 입력해서 검색하는것 ;lsp server가 지원할 경우
  lsp-ivy-workspace-symbol
  #+begin_src emacs-lisp
  (use-package lsp-ivy)
  #+end_src

** dap-mode
- Reference : https://emacs-lsp.github.io/dap-mode/page/confiruration/

#+begin_src emacs-lisp
  (use-package dap-mode
    :ensure t
    ;기존에는 dap-auto-configure-feature변수에 sessions locals breakpoints expressions controls tooltip다보임
    ;그 중 몇개만 보려면 아래처럼 set
    ;:custom
    ;(dap-auto-configure-features '(sessions locals tooltip))
  
    ;breakpoint걸릴때마다 hydra띄우기
    :hook (dap-stopped . (lambda (arg) (call-interactively #'dap-hydra))))
#+end_src

*** python debugging
#+begin_src shell
  pip install debugpy
#+end_src

#+begin_src emacs-lisp
  ;요거 python-mode에 추가함
  ;(dap-python-debugger 'debugpy)
#+end_src
- dap-debug : 하면  Run file 이나 pytest등 실행하는데 debug mode기반으로 pytest도 가능 브레이크 포인트 걸고
- dap-debug-edit-template : 하면 dap-debug시 뜨는 것 편집 가능
  #+begin_src shell
(dap-register-debug-template
  "Python :: Run Pytest (gallery_dl)"
  (list :type "python"
	:cwd "/home/hongiee/workspace/gallery_dl"
	:module "pytest"
	:request "launch"
	:name "Python :: Run pytest (gallery_dl)"))
  #+end_src

*** BASIC
- dap-debug : 디버그 실행 시작
- dap-next : step over
- dap-continue : continue
- dap-breakpoint-toggle : break point걸기
- dap-debug-last : 디버그 실행 재시작
- dap-switch-stack-frame : call stack에서 어디로 점프할지
- dap-disconnect : stop 디버깅
- dap-debug-restart : stop하고 바로 start한 효과
- dap-debug-recent : 최신 디버그 컨피그로 시작
- dap-ui-breakpoints : breakpoint 보여줌
- dap-ui-locals : locals 보여줌
- dap-ui-sessions : 현재 active인 디버그 세션 보여줌 : C-z로 evil에서 빠져나온 후 S-d로 세션 삭제 가능
- dap-debug-edit-template : 언어마다 템플릿 정할수 있는데 정한걸 이걸로 선택함
- dap-register-debug-template : 요걸로 템플릿을 정함 

- 아래 코드를 github에 debug.el같은데 같이 올리는것도 방법 그후 C-x C-e 로 eval시킬수 있음
- 상세 옵션은 vscode doc for debugger에서 볼 수 있음
#+begin_src emacs-lisp
;(dap-register-debug-template "My App"
;  (list :type "python"
;        :args "-i"
;        :cwd nil ; project root 설정
;        :env '(("DEBUG" . "1"))
;        :target-module (expand-file-name "~/src/myapp/.env/bin/myapp")
;        :request "launch"
;        :name "My App"))
;(dap-register-debug-template "Unit Test python"
;  (list :type "python"
;        :args "-i"
;        :cwd nil ; project root 설정
;        :env '(("DEBUG" . "1"))
;        :target-module (expand-file-name "~/src/myapp/.env/bin/myapp")
;        :request "launch"
;        :name "My App"))
#+end_src

*** BreakPoint : 언어마다 지원하는게 다름
- dap-breakpoint-toggle : breakpoint 만들기
- dap-breakpoint-delete-all : breakpoint 전체 삭제
- dap-breakpoint-condition : conditional breakpoint toggle로 브레이크 포인트 건 후 컨디션 걸기
- dap-breakpoint-hit-conditions : hit conditions, number of hits before breakpoint stops 그 자리에 몇번 지나갔는지
- dap-breakpoint-log-message : 해당 breakpoint에서 멈추지 않고 정한 로그 출력 {}사용
- dap-ui-breakpoints-list : show breakpoint panel 브레이크 포인트 건것들 보여주기
- dap-ui-repl : 어딘가 break point걸고 멈춘다음.>> a 입력시 해당 변수 값 볼 수 있음
*** Hydra
- dap-hydra : 단축키로 step등 쉽게하기
#+begin_src emacs-lisp
;  breakpoint걸릴때마다 hydra띄우기
;  :hook (dap-stopped . (lambda (arg) (call-interactively #'dap-hydra))))
#+end_src
*** Expressions
- dap-ui-expressions-add : i 처럼 특정 변수 보는 watch창
- dap-ui-expressions-remove : 삭제
*** REPL
- dap-ui-repl : 해당 언어에서 간단한 코드 실행 함수실행, 변수값 보기 바꾸기 i+5
*** Tooltips
- dap-tooltip-mode : turns it on 변수에 마우스 올리면 변수값등이 pop up발생하는것 등
- dap-tooltip-at-point : show the value at the current point 현재 위치 팝업을 강제로 띄우는 방식
*** load vscode debug config
- dap-debug 실행할때 vscode debug config도 동작함

** magit
- git checkout -t origin/저장소 (원격 저장소 브랜치를 내 로컬에 생성 후 땡길시)
- git checkout -b 내저장소이름 원격저장소이름(새로운 브랜치명으로 땡길때)
- M-x magit-clone 하고 주소 gl:users/reponame 하고 경로
- M-x magit-submodule-add
- C-x g -> magit-status로 바인딩 되어 있음
  - q로 끄고
  - g로 리프레시
  - s는 stage함
  - u는 unstage함
  - M-n, M-p 섹션 내에서 이전 다음으로 커서 이동
  - ^ 키는 해당 섹션의 상위로 커서 이동
  - c는 commit이고 여기서 C-c C-c하면 커밋 실행
    ce(extend)는 이전 커밋에 메시지 없이 내용만 추가
    ca(amend)는 이전 커밋에 amend하는데 메시지 수정
    cw(reward)는 메시지만 수정 (마지막 커밋메시지만 수정 가능)
  - 몇번 이전 git log에 커밋하는건 rebase를 이용해서 수정함
    cF(instant Fixup) 한담에 현재 stage수정을 어느 commit에 넣을지 선택하고 C-c C-c하면 됨. (나가는건 C-c C-k)
  - branch관련
    b - s - 새로운 브랜치 이름 (spin off) : upstream에 없는 commit들을 새로운 branch로 이동 하면서 생성 및 master는 이전으로 돌림
    b - b (checkout)
  - Push
    P - p : 동일 이름의 브랜치에 push
    P - -f - p : -f를 하면 flag가 set 됨
  - Pull
    F - p : 동일 이름의 브랜치에서 pull
    F - u : upstream에서 땡겨오기 (upstream에서 땡긴다던가 origin/master)
    F - e : 다른 브랜치에서 땡겨오기 (upstream에서 땡긴다던가 origin/master)
    F - r : 현재 브랜치 설정을 merge가 아닌 rebase로 (pull할때 merge하지 않고 rebase하도록)
	    그 다음에 땡기면 rebase를 하게됨. conflict는 수정후 r하면 지속 rebase하고 a하면 abort로 최초 상태로 돌아감
  - Fetch
    f - p : 동일 이름의 브랜치에서 fetch
    f - u : upstream에서 땡겨오기 (upstream에서 땡긴다던가 origin/master)
    f - e : 다른 브랜치에서 땡겨오기 (upstream에서 땡긴다던가 origin/master)
    f - a : all remote에서 땡겨오기
  - stash
    z - z : 로컬 수정(both stage, unstage)을 저장하고 remote를 pull하는 용도.
    z - a (apply): stash내용을 로콜로 돌리면서 stash는 유지
    z - p (pop): stash내용을 로컬로 돌리면서 stash기록을 지움
  - discard
    x - y :마지막에 했던 수정 돌리기 (evil써야 x이고 원래는 k)
	   unstage 에 있는 수정내용 되돌리기
	   untrack에 있는 파일 지우기
  - .gitignore에 추가
    i - t : untrack에 있는 파일 .gitignore에 추가할때
    i - s : untrack에 있는 파일 subdirectory .gitignore에 추가할때
    i - p : untrack에 있는 파일 .git/info/exclude 에 추가할때 (private한 gitignore)
  - rebase관련
    commit history로 가서 r - i rebase로 M-k M-j로 이동 spin-off로 합치기 squash로 합치기 등 가능 d는 지우기

#+begin_src emacs-lisp
  (use-package magit
    :ensure t)
#+end_src

- https://github.com/justbur/emacs-vdiff-magit
  
#+begin_src emacs-lisp
  (use-package vdiff-magit
    :ensure t)
  (require 'vdiff-magit)
  (require 'vdiff)
  (define-key magit-mode-map "e" 'vdiff-magit-dwim)
  (define-key magit-mode-map "E" 'vdiff-magit)
  (transient-suffix-put 'magit-dispatch "e" :description "vdiff (dwim)")
  (transient-suffix-put 'magit-dispatch "e" :command 'vdiff-magit-dwim)
  (transient-suffix-put 'magit-dispatch "E" :description "vdiff")
  (transient-suffix-put 'magit-dispatch "E" :command 'vdiff-magit)
#+end_src

