.emacs.d/init.el

(use-package python-mode
  :ensure nil
  ;:hook (python-mode . lsp-deferred) ;python mode켤때 lsp모드 켬
  :custom
  (python-shell-interpreter "python3")
  (dap-python-excutable "python3")
  (dap-python-debugger 'debugpy)
  :config
  (require 'dap-python)
)
;lsp mode to pyright
(use-package lsp-pyright
:ensure t
:hook (python-mode . (lambda ()
                        (require 'lsp-pyright)
                        (lsp))))

(use-package pyvenv
:config
(pyvenv-mode 1))

(use-package typescript-mode
  :mode "\\.ts\\'"
  :hook (typescript-mode . lsp-deferred)
  :config
  (setq typescript-indent-level 2))

(use-package yasnippet
  :ensure t
  :config
  (setq yas-snippet-dirs'("~/.emacs.d/snippets"))
  (yas-global-mode 1))

(defun efs/lsp-mode-setup()
  (setq lsp-headerline-breadcrumb-segments '(path-up-to-project file symbols))
  (lsp-headerline-breadcrumb-mode)) ;위에 경로 보여주기

(use-package lsp-mode
  :commands (lsp lsp-deferred)
  :hook (lsp-mode . efs/lsp-mode-setup)
  :init
  (setq lsp-keymap-prefix "C-c l")
  (setq lsp-idle-delay 0.1)
  :config
  (lsp-enable-which-key-integration t))

(use-package flymake-diagnostic-at-point
  ;:after flymake
  :config
  (add-hook 'flymake-mode-hook #'flymake-diagnostic-at-point-mode))
;(use-package flycheck
;  :ensure t
;  :init (global-flycheck-mode))

(use-package company
  :after lsp-mode
  :hook (lsp-mode . company-mode)
  :bind (:map company-active-map
         ("<tab>" . company-complete-selection))
        (:map lsp-mode-map
         ("<tab>" . company-indent-or-complete-common))
  :custom
  (company-minimum-prefix-length 1)
  (company-idle-delay 0.0))

(use-package company-box
  :hook (company-mode . company-box-mode))

(use-package lsp-ui
  :hook (lsp-mode . lsp-ui-mode))
;:custom
;(lsp-ui-doc-position 'bottom))

(use-package lsp-treemacs
  :after lsp)

(use-package lsp-ivy)

(use-package dap-mode
  :ensure t
  ;기존에는 dap-auto-configure-feature변수에 sessions locals breakpoints expressions controls tooltip다보임
  ;그 중 몇개만 보려면 아래처럼 set
  ;:custom
  ;(dap-auto-configure-features '(sessions locals tooltip))

  ;breakpoint걸릴때마다 hydra띄우기
  :hook (dap-stopped . (lambda (arg) (call-interactively #'dap-hydra))))

;요거 python-mode에 추가함
;(dap-python-debugger 'debugpy)

;(dap-register-debug-template "My App"
;  (list :type "python"
;        :args "-i"
;        :cwd nil ; project root 설정
;        :env '(("DEBUG" . "1"))
;        :target-module (expand-file-name "~/src/myapp/.env/bin/myapp")
;        :request "launch"
;        :name "My App"))
;(dap-register-debug-template "Unit Test python"
;  (list :type "python"
;        :args "-i"
;        :cwd nil ; project root 설정
;        :env '(("DEBUG" . "1"))
;        :target-module (expand-file-name "~/src/myapp/.env/bin/myapp")
;        :request "launch"
;        :name "My App"))

;  breakpoint걸릴때마다 hydra띄우기
;  :hook (dap-stopped . (lambda (arg) (call-interactively #'dap-hydra))))

(use-package magit
  :ensure t)
