.emacs.d/init.org
* File/Dir Local Valiables
Run =M-x normal-mode= to active
특정 파일/디렉토리에 대한 세팅
Two forms:
#+begin_src emacs-lisp
;; -*- mode: emacs-lisp; tab-width: 8; -*-
#+end_src

#+begin_src emacs-lisp
  
  ;; Local Variables:
  ;; mode: emacs-lisp
  ;; tab-width: 8
  ;; eval; (eldoc-mode 0)
  ;; End:
  
#+end_src

Comands:
- =add-dir-local-variable= : Add local variable to the files in the dir
  파일 모드에 따라 file local variable을 다르게 설정가능
  org-mode magit-diff-mode등
  설정하면 .dir-locals.el파일에 모드별설정이 저장이 됨
  
- =add-file-local-variable= : Add local variable to the file
  add전에 mode를 먼저 셋해야할수 있음
- =delete-file-local-variable= :파일에 있는 변수 삭제
- =copy-file-locals-to-dir-locals=
  :  파일에 있는걸 디렉토리 쪽으로 복사
- =copy-dir-locals-to-file-locals=
  :  디렉토리 있는걸 파일로 복사
- =projectile-edit-dir-locals=

Variables:
=safe-local-variable-values=
=safe-local-eval-forms
=enable-local-variable=
- t 하면 add-file-local-variable 할때 safe하지 않으면 물어봄
- nil하면 안하는거고
- safe하면 safe한것만 됨
- all 무조건 로드
=enable-local-eval=
- maybe하면 기본 프롬프트
- t하면 자동 eval
- nil하면 스킵

* Org Mode
** 기본 사용법
- head
  *는 첫째 head , =C-<return>= 새로운 아이템을 추가함 동일레벨로, =M-<ret>= 도 동일 대신위
  **는 둘째 head, =M-up= 같은거는 동일레벨에서 위치 위아래로 바꿈,
                 =S-M-up= 하면 레벨 관계없이 한줄단위 변경가능
  S-tab하면 head 아래 보이는걸 줄여주기도 함
- link
  org-insert-link, 글자선택후 =C-c C-l= 하면 하이퍼링크 삽입가능; =C-c C-o= 하면 현재 커서 링크를 열게됨

- table
  table |--|--|--| esc하고 =M-<ret>= 하면 가로줄 생김, =tab= 은 정렬기능 
  
- list
  list 는 - item, 1. item 하고 입력하면 되고 뒤에서 =M-<ret>= 하면 바로 아래줄 아이템 추가
  S-> 하면 리스트 모양 바뀜 - 1) 등등

- check list
 check list [ ]  안에 X넣어도 되고 =C-c C-x C-b= C를 홀드 하고 cxb하면 됨
              =S-M-<ret>= 하면 체크박스 추가됨 (list에서 이키는 체크박스 추가)딴데서는 todo로 사용됨
- souce block
  #+begin_src python :results output
  #이렇게 하면 print한 결과가 result에 나옴
  #+end_src


- TODO
 TODO는 heading에서 todo입력하면 됨 =C-c C-t= 하면 done으로 바뀜 S-방향키 해도 됨

- *bold*, /test/, _underlined_, =verbatim= and ~code~
  * b *, / i / , _ u _ , = v =, ~ c ~
#+BEGIN_SRC emacs-lisp :results output
(setq org-emphasis-alist
	'(("*" (bold :foreground "red"))
      ("_" underline)
	  ("/" italic)
	  ("=" org-verbatim verbatim)
	  ("~" org-code verbatim)
	  ("+" (:strike-through t))))

 #+END_SRC

 
 C-x X h h : 하이라이트 하기
 C-x X u r : 하이라이트 지우기
 #+BEGIN_SRC emacs-lisp :results output
   (use-package highlight
     :ensure t)
 #+END_SRC

** Org 단축키
- org-agenda org-agenda-list
- org-schedule삽입 =C-c C-s= shift누르고 방향키 한담에 <ret>
- org-todo 상태변경 =C-c C-t=
- org-deadline =C-c C-d=
-  org-deadline-warning-days로 agenda에 나타나는 날자를 정할수 있음
- org-timestamp =C-c .=
- repeated tasks~ every one day, 등등 알람을 계속주는것
-  +1y를 붙이면  +2d +1d등등 하면 됨<2022-02-07 월+1d>
- org-wild-notifer 는 os와 상관없이 노티를 날려주는 패키지
- task state를 줘서 todo 리스트를 관리할수 있음
- counsel-org-tag 한담에 tag를 추가할 수 잇음 M-<ret>해서 여러개 추가나 선택도 가능
- org-agenda-custom-commands, org-tag-alist같은 패키지들로 태그 관리가능.
- org-set-effort 
- org-set-properties effort 5 days =C-c C-x p=
  
** 기본 설정

#+begin_src emacs-lisp
  (defun efs/org-mode-setup()
    (org-indent-mode)
    ;(variable-pitch-mode 1)
    ;(auto-fill-mode 0)
    (visual-line-mode 1))
    ;(setq evil-auto-indent nil))
                                          ;(use-package toc-org)
#+end_src

** Org custom 설정

#+begin_src emacs-lisp
  (use-package org
    :hook (org-mode . efs/org-mode-setup) ;훅을 쓰는 이유는 org buffer시작할때마다 위에설정 호출해서 그버퍼는 변수상태로 셋업하기 위함.
    :config
    (setq org-ellipsis " ▾" ; S-tab하면 ... 나오는걸 이걸로 바꾸기 위함
          org-hide-emphasis-markers t) ;bold link등 */같은거 안보이게
    (setq org-agenda-start-with-log-mode t)
    (setq org-log-done 'time)
    (setq org-log-into-drawer t)

    ;todo의 종류들을 추가하는 것으로 |기준으로 active냐 종료상태를 좌우로 나뉨
    (setq org-todo-keywords
          '((sequenct "TODO(t)" "NEXT(n)" "|" "DONE(d!)")
            (sequence "BACKLOG(b)" "PLAN(p)" "READY(r)" "ACTIVITE(a)" "REVIEW(v)" "WAIT(w@/!)" "|" "COMPLETED(c)" "CANC(k@)")))
    (setq org-refile-targets
          '((nil :maxlevel . 1)
           (org-agenda-files :maxlevel . 1))))

  (if (eq system-type 'darwin)
      (setq org-agenda-files ; agenda에서 관리할 파일 리스트로 ""다음줄에 ""또넣어도됨
        '("~/Notes/agenda.org" ;macos
          "~/.emacs.d/README.org" ;linux
          "~/workspace/org/tasks.org"))) ; '요거 하나는 뒤에가 리스트라는 의미로 펑션콜이 아님을 의미
  (setq org-startup-with-inline-images t) ; org에서 그림파일 항상 보이게
  
  ;(advice-add 'org-refile :after 'org-save-all-org-buffers)
  ;이렇게 하면 org-refile실행시 바로 org-save-all-org-buffers가 실행이됨
#+end_src

#+RESULTS:
: ((nil :maxlevel . 1) (org-agenda-files :maxlevel . 1))

** hook
#+begin_src emacs-lisp
  ;스크린 캡처
  (add-hook 'org-mode-hook
    (lambda ()
      (defun cam ()
        (interactive)
        (if buffer-file-name
          (progn
	    (message "Waiting for region selection with mouse ...")
	    (make-directory "./images/" t)
	    (let ((filename
	           (concat "./images/"
	                   (file-name-nondirectory buffer-file-name)
	          	 "_"
	          	 (format-time-string "%Y%m%d_%H%M%S")
	          	 ".png")))
	      (if (executable-find "scrot")
	          (call-process "scrot" nil nil nil "-s" filename)
	          (call-process "screencapture" nil nil nil "-s" filename))
	      (insert (concat "[[" filename "]]"))
	      (org-display-inline-images t t)
	    )
	    (message "File created and linked ...")
          )
          (message "You're in a not saved buffer! Save it first!")
        )
      )
    )
  )
  (add-hook 'org-babel-after-execute-hook 'org-redisplay-inline-images)
#+end_src

** Head 를 좀더 멋지게 수정

#+begin_src emacs-lisp
  ;head마다 다른 사이즈
  (require 'org-faces)
  (dolist (face '((org-level-1 . 1.1)
                  (org-level-2 . 1.07)
                  (org-level-3 . 1.05)
                  (org-level-4 . 1.0)
                  (org-level-5 . 1.0)
                  (org-level-6 . 1.0)
                  (org-level-7 . 1.0)
                  (org-level-8 . 1.0)))
    (set-face-attribute (car face) nil :font "D2Coding" :weight 'medium :height (cdr face)))
  ;head마다 끝에만 보이게 하되 글자를 다음처럼 바꾸라
  (use-package  org-bullets
    :after org
    :hook (org-mode . org-bullets-mode)
    :custom
    (org-bullets-bullet-list '("*" "○" "●" "○" "●" "○" "●")))

  ; list hyphen 을 dot으로 수정
  ; 정규식으로 이걸 만듬
  (font-lock-add-keywords 'org-mode
                          '(("^ *\\([-]\\) "
                              (0 (prog1 () (compose-region (match-beginning 1) (match-end 1) "•"))))))
#+end_src

** Org Mode 가운데 정렬

#+begin_src emacs-lisp
;;visual fill mode는 org mode가 왼쪽에 치우친걸 상황을 바꿈
;set margins mode
;(defun efs/org-mode-visual-fill ()
;  (setq visual-fill-column-width 110
;        visual-fill-column-center-text t)
;  (visual-fill-column-mode 1))
;(use-package visual-fill-column
;  :hook (org-mode . efs/org-mode-visual-fill))
#+end_src

** Org Capture
- M-x org-capture 해서 새로운 org file만들때 기본 템플릿을 정의하는것


#+begin_src emacs-lisp
  ;org-capture
  ;org-capture-templates
  (setq org-capture-templates
    `(("t" "Tasks / Projects")
      ;("tt" "Task" entry (file+olp "~/workspace/org/tasks.org" "Inbox") ; macos
      ("tt" "Task" entry (file+olp "~/.emacs.d/README.org" "Inbox") ;linux
           "* TODO %?\n  %U\n  %a\n  %i" :empty-lines 1)

      ("j" "Journal Entries")
      ("jj" "Journal" entry
           (file+olp+datetree "~/.emacs.d/README.org")
           "\n* %<%I:%M %p> - Journal :journal:\n\n%?\n\n"
           ;; ,(dw/read-file-as-string "~/Notes/Templates/Daily.org")
           :clock-in :clock-resume
           :empty-lines 1)
      ;("jm" "Meeting" entry
      ;     (file+olp+datetree "~/Projects/Code/emacs-from-scratch/OrgFiles/Journal.org")
      ;     "* %<%I:%M %p> - %a :meetings:\n\n%?\n\n"
      ;     :clock-in :clock-resume
      ;     :empty-lines 1)

      ;("w" "Workflows")
      ;("we" "Checking Email" entry (file+olp+datetree "~/Projects/Code/emacs-from-scratch/OrgFiles/Journal.org")
      ;     "* Checking Email :email:\n\n%?" :clock-in :clock-resume :empty-lines 1)

      ;("m" "Metrics Capture")
      ;("mw" "Weight" table-line (file+headline "~/Projects/Code/emacs-from-scratch/OrgFiles/Metrics.org" "Weight")
      ; "| %U | %^{Weight} | %^{Notes} |" :kill-buffer t)
      ))

  (define-key global-map (kbd "C-c j")
    (lambda () (interactive) (org-capture nil "jj")))

#+end_src

** Org Alert
- install 할때 org-plus-contrib가 있는지 보고 설치함
- =DBUS ERROR=
: eval &(dbus-launch)
: export DBUS_SESSIN_BUS_ADDRESS
: emacs

- =org-notify-add= 확인
#+begin_src emacs-lisp
  (use-package org
  :ensure org-plus-contrib)

  (use-package org-notify
  :ensure nil
  :after org
  :config
  (org-notify-start)
  (org-notify-add
   'default
   '(:time "10m" :period "5s" :duration 100 :actions -notify)
   '(:time "7m" :period "5s" :duration 50 :actions -notify/window))
  (org-notify-add
   'reminder
   '(:time "10m" :period "5s" :duration 100 :actions -notify)))
#+end_src

** Org Babel 
*** 코드블럭 실행
- M-x org-babel-execute-src-block
- 단축키 블럭에 가서 C-c C-c

- org-confirm-babel-evaluate nil 하면 실행시 팝업 띄울지 아니오로

- file local value를 아래형태로 셋해서 저장할때 실행도 가능
- (add-hook 'after-save-hook #'org-babel-execute-buffer t t)
  -> t t가 이 버퍼만 셋하겠다는 의미?

- #+begin_src python :results output
- #이렇게 하면 print한 결과가 result에 나옴
- #+end_src

- #+begin_src python :results value
- #이렇게 하면 return한 결과가 result에 나옴
- #+end_src

*변수 넘기는법*
- #+name: first_block
- #+BEGIN_SRC python
- x = 12
- return x
- #+END_SRC

- #+BEGIN_RC python :var x=first_block
- return int(x)+1
- #+END_SRC

