.emacs.d/init.el

;; -*- mode: emacs-lisp; tab-width: 8; -*-

;; Local Variables:
;; mode: emacs-lisp
;; tab-width: 8
;; eval; (eldoc-mode 0)
;; End:

(setq org-emphasis-alist
	'(("*" (bold :foreground "red"))
      ("_" underline)
	  ("/" italic)
	  ("=" org-verbatim verbatim)
	  ("~" org-code verbatim)
	  ("+" (:strike-through t))))

(use-package highlight
  :ensure t)

(defun efs/org-mode-setup()
  (org-indent-mode)
  ;(variable-pitch-mode 1)
  ;(auto-fill-mode 0)
  (visual-line-mode 1))
  ;(setq evil-auto-indent nil))
                                        ;(use-package toc-org)

(use-package org
  :hook (org-mode . efs/org-mode-setup) ;훅을 쓰는 이유는 org buffer시작할때마다 위에설정 호출해서 그버퍼는 변수상태로 셋업하기 위함.
  :config
  (setq org-ellipsis " ▾" ; S-tab하면 ... 나오는걸 이걸로 바꾸기 위함
        org-hide-emphasis-markers t) ;bold link등 */같은거 안보이게
  (setq org-agenda-start-with-log-mode t)
  (setq org-log-done 'time)
  (setq org-log-into-drawer t)

  ;todo의 종류들을 추가하는 것으로 |기준으로 active냐 종료상태를 좌우로 나뉨
  (setq org-todo-keywords
        '((sequenct "TODO(t)" "NEXT(n)" "|" "DONE(d!)")
          (sequence "BACKLOG(b)" "PLAN(p)" "READY(r)" "ACTIVITE(a)" "REVIEW(v)" "WAIT(w@/!)" "|" "COMPLETED(c)" "CANC(k@)")))
  (setq org-refile-targets
        '((nil :maxlevel . 1)
         (org-agenda-files :maxlevel . 1))))

(if (eq system-type 'darwin)
    (setq org-agenda-files ; agenda에서 관리할 파일 리스트로 ""다음줄에 ""또넣어도됨
      '("~/Notes/agenda.org"
        "~/workspace/org/tasks.org"))) ; '요거 하나는 뒤에가 리스트라는 의미로 펑션콜이 아님을 의미
(setq org-startup-with-inline-images t) ; org에서 그림파일 항상 보이게

;(advice-add 'org-refile :after 'org-save-all-org-buffers)
;이렇게 하면 org-refile실행시 바로 org-save-all-org-buffers가 실행이됨

;스크린 캡처
(add-hook 'org-mode-hook
  (lambda ()
    (defun cam ()
      (interactive)
      (if buffer-file-name
        (progn
	  (message "Waiting for region selection with mouse ...")
	  (make-directory "./images/" t)
	  (let ((filename
	         (concat "./images/"
	                 (file-name-nondirectory buffer-file-name)
	               "_"
	               (format-time-string "%Y%m%d_%H%M%S")
	               ".png")))
	    (if (executable-find "scrot")
	        (call-process "scrot" nil nil nil "-s" filename)
	        (call-process "screencapture" nil nil nil "-s" filename))
	    (insert (concat "[[" filename "]]"))
	    (org-display-inline-images t t)
	  )
	  (message "File created and linked ...")
        )
        (message "You're in a not saved buffer! Save it first!")
      )
    )
  )
)
(add-hook 'org-babel-after-execute-hook 'org-redisplay-inline-images)

;head마다 다른 사이즈
(require 'org-faces)
(dolist (face '((org-level-1 . 1.1)
                (org-level-2 . 1.07)
                (org-level-3 . 1.05)
                (org-level-4 . 1.0)
                (org-level-5 . 1.0)
                (org-level-6 . 1.0)
                (org-level-7 . 1.0)
                (org-level-8 . 1.0)))
  (set-face-attribute (car face) nil :font "D2Coding" :weight 'medium :height (cdr face)))
;head마다 끝에만 보이게 하되 글자를 다음처럼 바꾸라
(use-package  org-bullets
  :after org
  :hook (org-mode . org-bullets-mode)
  :custom
  (org-bullets-bullet-list '("*" "○" "●" "○" "●" "○" "●")))

; list hyphen 을 dot으로 수정
; 정규식으로 이걸 만듬
(font-lock-add-keywords 'org-mode
                        '(("^ *\\([-]\\) "
                            (0 (prog1 () (compose-region (match-beginning 1) (match-end 1) "•"))))))

;;visual fill mode는 org mode가 왼쪽에 치우친걸 상황을 바꿈
;set margins mode
;(defun efs/org-mode-visual-fill ()
;  (setq visual-fill-column-width 110
;        visual-fill-column-center-text t)
;  (visual-fill-column-mode 1))
;(use-package visual-fill-column
;  :hook (org-mode . efs/org-mode-visual-fill))

;org-capture
;org-capture-templates
(setq org-capture-templates
  `(("t" "Tasks / Projects")
    ("tt" "Task" entry (file+olp "~/workspace/org/tasks.org" "Inbox")
         "* TODO %?\n  %U\n  %a\n  %i" :empty-lines 1)

    ("j" "Journal Entries")
    ("jj" "Journal" entry
         (file+olp+datetree "~/.emacs.d/README.org")
         "\n* %<%I:%M %p> - Journal :journal:\n\n%?\n\n"
         ;; ,(dw/read-file-as-string "~/Notes/Templates/Daily.org")
         :clock-in :clock-resume
         :empty-lines 1)
    ;("jm" "Meeting" entry
    ;     (file+olp+datetree "~/Projects/Code/emacs-from-scratch/OrgFiles/Journal.org")
    ;     "* %<%I:%M %p> - %a :meetings:\n\n%?\n\n"
    ;     :clock-in :clock-resume
    ;     :empty-lines 1)

    ;("w" "Workflows")
    ;("we" "Checking Email" entry (file+olp+datetree "~/Projects/Code/emacs-from-scratch/OrgFiles/Journal.org")
    ;     "* Checking Email :email:\n\n%?" :clock-in :clock-resume :empty-lines 1)

    ;("m" "Metrics Capture")
    ;("mw" "Weight" table-line (file+headline "~/Projects/Code/emacs-from-scratch/OrgFiles/Metrics.org" "Weight")
    ; "| %U | %^{Weight} | %^{Notes} |" :kill-buffer t)
    ))

(define-key global-map (kbd "C-c j")
  (lambda () (interactive) (org-capture nil "jj")))

(use-package org
:ensure org-plus-contrib)

(use-package org-notify
:ensure nil
:after org
:config
(org-notify-start)
(org-notify-add
 'default
 '(:time "10m" :period "5s" :duration 100 :actions -notify)
 '(:time "7m" :period "5s" :duration 50 :actions -notify/window))
(org-notify-add
 'reminder
 '(:time "10m" :period "5s" :duration 100 :actions -notify)))
