.emacs.d/init.org
*** Tangle
:LOGBOOK:
- Note taken on [2022-09-13 화 00:13]
:END:
- #+PROPERTY: header-args:emacs-lisp :tangle ./init-new.el하면 모든 내용이 저 파일로 옮겨짐
- org-babel-tangle C-c C-v t 블록을 딴 파일에 저장.
  이걸 이용해서 emacs를 시작하도록 하면 됨.
- #+begin_src python :tangle ./newpython.py
  org-babel-tangle-file "파일명" 으로 자동으로 해당파일을 tangle하도록 할 수 있음

  ;이 파일을 저장하면 자동으로 tangle해서 저장하도록 하고싶다면
- #+PROPERTY: header-args:emacs-lisp :tangle ./init-new.el
  
#+begin_src emacs-lisp
  ; org-babel에서 사용할수 있는 언어 등록
  (org-babel-do-load-languages
   'org-babel-load-languages
   '((emacs-lisp . t)
     (C . t)
     (python . t)))
  
  
  (setq org-confirm-babel-evaluate nil) ;;실행할지 묻는거 끄기
  (setq org-babel-python-command "python3") ;;python3써라
  
  ;;<py 입력후 탭 하면 블록이 생김
  (require 'org-tempo)
  (add-to-list 'org-structure-template-alist '("sh" . "src shell"))
  (add-to-list 'org-structure-template-alist '("el" . "src emacs-lisp"))
  (add-to-list 'org-structure-template-alist '("py" . "src python"))
  
  (if (eq system-type 'darwin)
  ;이 파일을 저장하면 자동으로 tangle해서 저장하도록 하고싶다면
      (defun efs/org-babel-tangle-config ()
        (when (string-equal (buffer-file-name)
                        (expand-file-name "/Users/eddie/.emacs.d/init.org"))
          (let ((org-confirm-babel-evaluate nil))
            (org-babel-tangle)))))
  (if (eq system-type 'gnu/linux)
  ;이 파일을 저장하면 자동으로 tangle해서 저장하도록 하고싶다면
      (defun efs/org-babel-tangle-config ()
        (when (string-equal (file-name-directory (buffer-file-name))
                        (expand-file-name "~/.emacs.d/"))
          (let ((org-confirm-babel-evaluate nil))
            (org-babel-tangle)))))
   (add-hook 'org-mode-hook (lambda ()(add-hook 'after-save-hook #'efs/org-babel-tangle-config)))
#+end_src

- output파일에 폴더 생성 원할시 =:mkdirp yes= 를 추가
  #+begin_src emacs-lisp
  ;(push '("confi-unix" . confi-unix) org-src-lang-mode)
  #+end_src

  #+begin_src conf :tangle ~/dummy.conf :mkdirp yes
	;value = 42

  #+end_src

*** Noweb
- 블럭의 결과를 다른 블럭에 쓰거나 할때 씀 json이나 txt파일들을 쓸때도 씀.
- :noweb yes하면 값을 가져올 수 있음

#+NAME: the-value
  #+begin_src emacs-lisp
;(+ 55 100)
  #+end_src

  #+RESULTS: the-value
  : 155


#+begin_src python :noweb yes :results output
	print(<<the-value()>>)
#+end_src

#+RESULTS:
: 155

** Org Mode website
- build-site.el
- org에 기본적으로 내제된 ox-publish를 임포트 후, 메시지 만들기
- M-x describie-va.. 한담에 org-publish-project-alist검색하면 프로젝트 설정하는 설명 나옴
  : org-html하면 많이 나옴
- content라는 폴더에 index.org 파일을 두면 해당 파일이 기본이 됨
- www.simplecss.org 등 참고
- C-c C-l Org-insert-link로 링크 만들기 ./emacs.org
#+BEGIN_SRC emacs-lisp
  ;;코드블락을 지원하기 위해 htmlize를 설치
  (require 'package)
  (setq package-user-dir (expand-file-name "./.packages"))
  (setq package-archives '(("melpa" . "https://melpa.org/packages/")
                           ("elpa" . "https://elpa.gnu.org/packages/")))
  (package-initialize)
  (unless package-archive-contents
    (package-refresh-contents))
  (package-install 'htmlize)

  ;;여기서 시작
  (require 'ox-publish)

  (setq org-html-validation-link nil ;;html마지막에 validate뜨는거 막기
        org-html-head-include-scripts nil ;;use our own scripts
        org-html-head-include-default-style nil ;;use our own styles
        org-html-head "<link rel=\"stylesheet\" href=\"https://cdn.simplecss.org/simple.min.css\" />")


  ;;define the publishing project list가 두개인건 첫번재는 전체 프로젝트 그룹, 두번째는 그중 하나 프로젝트
  (setq org-publish-project-alist
        (list
         (list "my-org-site"
               :recursive t ;;sub folder들도 찾아보게함
               :base-directory "./content"
               :publishing-directory "./pubilsh"
               :publishing-function 'org-html-publish-to-html
	           :with-author nil    ;; don't include author name
	           :with-creator nil     ;; include Emacs and Org versions in folder
	           :with-toc nil         ;; include a table of contents
	           :section-numbers nil ;; Don't include section number
	           :time-stamp-file nil ;; Don't include time stamp in file
	     )))
  ;; Generate the site output
  (org-publish-all t) ;;t는 캐시파일쓰지말고 다시 생성하라는 뜻임
  (message "Build complete")
#+END_SRC

- build.sh
- emacs lisp 스크립트를 돌릴 쉘파일 필요함
- -Q 를 넣어야 기본 컨피그를 로드하지 않음
- chmod +x build.sh
#+BEGIN_SRC sh
  #!/bin/sh
  emacs -Q --script build-site.el
#+END_SRC

- website를 호스트해서 브라우저에서 볼수있게 해줌
- M-x httpd-serve-directory 명령으로 사이트 띄우자
- 기본적으로 8080폴더를 쓰니 변화를 필요로하면 httpd-port변수를 셋하면 됨
#+BEGIN_SRC emacs-lisp
  (use-package simple-httpd
    :ensure t)

#+END_SRC




** Org Roam
