.emacs.d/init.el

; org-babel에서 사용할수 있는 언어 등록
(org-babel-do-load-languages
 'org-babel-load-languages
 '((emacs-lisp . t)
   (C . t)
   (python . t)))


(setq org-confirm-babel-evaluate nil) ;;실행할지 묻는거 끄기
(setq org-babel-python-command "python3") ;;python3써라

;;<py 입력후 탭 하면 블록이 생김
(require 'org-tempo)
(add-to-list 'org-structure-template-alist '("sh" . "src shell"))
(add-to-list 'org-structure-template-alist '("el" . "src emacs-lisp"))
(add-to-list 'org-structure-template-alist '("py" . "src python"))

(if (eq system-type 'darwin)
;이 파일을 저장하면 자동으로 tangle해서 저장하도록 하고싶다면
    (defun efs/org-babel-tangle-config ()
      (when (string-equal (buffer-file-name)
                      (expand-file-name "/Users/eddie/.emacs.d/init.org"))
        (let ((org-confirm-babel-evaluate nil))
          (org-babel-tangle)))))
(if (eq system-type 'gnu/linux)
;이 파일을 저장하면 자동으로 tangle해서 저장하도록 하고싶다면
    (defun efs/org-babel-tangle-config ()
      (when (string-equal (file-name-directory (buffer-file-name))
                      (expand-file-name "~/.emacs.d/"))
        (let ((org-confirm-babel-evaluate nil))
          (org-babel-tangle)))))
 (add-hook 'org-mode-hook (lambda ()(add-hook 'after-save-hook #'efs/org-babel-tangle-config)))

;(push '("confi-unix" . confi-unix) org-src-lang-mode)

;(+ 55 100)

;;코드블락을 지원하기 위해 htmlize를 설치
(require 'package)
(setq package-user-dir (expand-file-name "./.packages"))
(setq package-archives '(("melpa" . "https://melpa.org/packages/")
                         ("elpa" . "https://elpa.gnu.org/packages/")))
(package-initialize)
(unless package-archive-contents
  (package-refresh-contents))
(package-install 'htmlize)

;;여기서 시작
(require 'ox-publish)

(setq org-html-validation-link nil ;;html마지막에 validate뜨는거 막기
      org-html-head-include-scripts nil ;;use our own scripts
      org-html-head-include-default-style nil ;;use our own styles
      org-html-head "<link rel=\"stylesheet\" href=\"https://cdn.simplecss.org/simple.min.css\" />")


;;define the publishing project list가 두개인건 첫번재는 전체 프로젝트 그룹, 두번째는 그중 하나 프로젝트
(setq org-publish-project-alist
      (list
       (list "my-org-site"
             :recursive t ;;sub folder들도 찾아보게함
             :base-directory "./content"
             :publishing-directory "./pubilsh"
             :publishing-function 'org-html-publish-to-html
	         :with-author nil    ;; don't include author name
	         :with-creator nil     ;; include Emacs and Org versions in folder
	         :with-toc nil         ;; include a table of contents
	         :section-numbers nil ;; Don't include section number
	         :time-stamp-file nil ;; Don't include time stamp in file
	   )))
;; Generate the site output
(org-publish-all t) ;;t는 캐시파일쓰지말고 다시 생성하라는 뜻임
(message "Build complete")

(use-package simple-httpd
  :ensure t)
