.emacs.d/init.org
*** install
- v2버전의 org roam부터 sqlite가 필요함
- sqlite가 설치되었는지 확인하는 변수 *org-roam--sqlite-available-p*
  이걸 describe value C-h v 로 확인하자
- 몇자 입력하고 M-x completion-at-point 입력하면 roam: link 가 생성됨

#+BEGIN_SRC emacs-lisp
  (use-package org-roam
    :ensure t
    :init
    (setq org-roam-v2-ack t) ;roam v1쓸경우 팝업창 뜨는걸 방지
    :custom
    (org-roam-directory "~/Notes")
    (org-roam-completion-everywhere t)
    (org-roam-capture-templates
     '(("d" "default" plain
        "%?"
        :if-new (file+head "%<%Y%m%d%H%M%S>-${slug}.org" "#+title: ${title}\n")
        :unnarrowed t)
       ("b" "book notes" plain
          (file "~/.emacs.d/Templates/BookNote.org")
          :if-new (file+head "%<%Y%m%d%H%M%S>-${slug}.org" "#+title: ${title}\n")
          :unnarrowed t)
       ("p" "project" plain "* Goals\n\n%?\n\n* Tasks\n\n** TODO Add initial tasks\n\n* Dates\n\n"
        :if-new (file+head "%<%Y%m%d%H%M%S>-${slug}.org" "#+title: ${title}\n#+filetags: Project")
        :unnarrowed t)
       ))
    (org-roam-dailies-capture-templates
     '(("d" "default" entry "* %?  =%<<%I:%M %p>>=\n"
        :if-new (file+head "%<%Y-%m-%d>.org" "#+title: %<%Y-%m-%d>\n"))))
    :bind (("C-c n b" . org-roam-buffer-toggle)
           ("C-c n f" . org-roam-node-find)
           ("C-c n i" . org-roam-node-insert)
           ("C-c n l" . org-id-get-create)
           ("C-c n g" . org-roam-graph)
           :map org-mode-map
           ("C-M-i" . completion-at-point)
           :map org-roam-dailies-map
           ("Y" . org-roam-dailies-capture-yesterday)
           ("T" . org-roam-dailies-capture-tomorrow)
           ("g" . org-roam-dailies-goto-date)
           ("G" . org-roam-dailies-capture-date))
    :bind-keymap
    ("C-c n d" . org-roam-dailies-map)
    :config
    (require 'org-roam-dailies)
    (org-roam-setup)
    (org-roam-db-autosync-mode))

  ;(setq org-roam-dailies-directory "journal/") ;daily가 아닌 폴더를 하위폴더로 쓸 경우 지정필요

  ;;필요한 함수 셋업
  (defun org-roam-node-insert-immediate (arg &rest args)
    (interactive "P")
    (let ((args (push arg args))
          (org-roam-capture-templates (list (append (car org-roam-capture-templates)
                                                    '(:immediate-finish t)))))
      (apply #'org-roam-node-insert args)))

  (defun my/org-roam-filter-by-tag (tag-name)
    (lambda (node)
      (member tag-name (org-roam-node-tags node))))

  ;org-roam-node-list가 없어서 주석처리
  (defun my/org-roam-list-notes-by-tag (tag-name)
    (mapcar #'org-roam-node-file
            (seq-filter
             (my/org-roam-filter-by-tag tag-name)
             (org-roam-node-list))))

  (defun my/org-roam-refresh-agenda-list ()
    (interactive)
    (setq org-agenda-files (my/org-roam-list-notes-by-tag "Project")))

  ;; Build the agenda list the first time for the session
  (my/org-roam-refresh-agenda-list)

  ;; Bind this to C-c n I ; 첫 캡처템플릿으로 만들기만하고 현 buffer에 머무르기
  (defun org-roam-node-insert-immediate (arg &rest args)
    (interactive "P")
    (let ((args (cons arg args))
          (org-roam-capture-templates (list (append (car org-roam-capture-templates)
                                                    '(:immediate-finish t)))))
      (apply #'org-roam-node-insert args)))


  ;; 특정 tag의 note list를 선택하기
  (defun my/org-roam-project-finalize-hook ()
    ;"Adds the captured project file to `org-agenda-files' if the capture was not aborted."
    ;; Remove the hook since it was added temporarily
    (remove-hook 'org-capture-after-finalize-hook #'my/org-roam-project-finalize-hook)

    ;; Add project file to the agenda list if the capture was confirmed
    (unless org-note-abort
      (with-current-buffer (org-capture-get :buffer)
        (add-to-list 'org-agenda-files (buffer-file-name)))))

  (defun my/org-roam-find-project ()
    (interactive)
    ;; Add the project file to the agenda after capture is finished
    (add-hook 'org-capture-after-finalize-hook #'my/org-roam-project-finalize-hook)

    ;; Select a project file to open, creating it if necessary
    (org-roam-node-find
     nil
     nil
     (my/org-roam-filter-by-tag "Project")
     :templates
     '(("p" "project" plain "* Goals\n\n%?\n\n* Tasks\n\n** TODO Add initial tasks\n\n* Dates\n\n"
        :if-new (file+head "%<%Y%m%d%H%M%S>-${slug}.org" "#+title: ${title}\n#+category: ${title}\n#+filetags: Project")
        :unnarrowed t))))

  ;;지금 쓰는것과 상관없는거 떠오를때 inbox.org에 임시저장하기 위한것
  (defun my/org-roam-capture-inbox ()
    (interactive)
    (org-roam-capture- :node (org-roam-node-create)
                       :templates '(("i" "inbox" plain "* %?"
                                    :if-new (file+head "Inbox.org" "#+title: Inbox\n")))))


  ;capture a task directly into a specific project
  (defun my/org-roam-capture-task ()
    (interactive)
    ;; Add the project file to the agenda after capture is finished
    (add-hook 'org-capture-after-finalize-hook #'my/org-roam-project-finalize-hook)

    ;; Capture the new task, creating the project file if necessary
    (org-roam-capture- :node (org-roam-node-read
                              nil
                              (my/org-roam-filter-by-tag "Project"))
                       :templates '(("p" "project" plain "* TODO %?"
                                     :if-new (file+head+olp "%<%Y%m%d%H%M%S>-${slug}.org"
                                                            "#+title: ${title}\n#+category: ${title}\n#+filetags: Project"
                                                            ("Tasks"))))))
  (defun my/org-roam-copy-todo-to-today ()
    (interactive)
    (let ((org-refile-keep t) ;; Set this to nil to delete the original!
          (org-roam-dailies-capture-templates
            '(("t" "tasks" entry "%?"
               :if-new (file+head+olp "%<%Y-%m-%d>.org" "#+title: %<%Y-%m-%d>\n" ("Tasks")))))
          (org-after-refile-insert-hook #'save-buffer)
          today-file
          pos)
      (save-window-excursion
        (org-roam-dailies--capture (current-time) t)
        (setq today-file (buffer-file-name))
        (setq pos (point)))

      ;; Only refile if the target file is different than the current file
      (unless (equal (file-truename today-file)
                     (file-truename (buffer-file-name)))
        (org-refile nil nil (list "Tasks" today-file nil pos)))))

  (add-to-list 'org-after-todo-state-change-hook
               (lambda ()
                 (when (equal org-state "DONE")
                   (my/org-roam-copy-todo-to-today)))) 
  (global-set-key (kbd "C-c n t") #'my/org-roam-capture-task)
  (global-set-key (kbd "C-c n T") #'my/org-roam-capture-inbox)
  (global-set-key (kbd "C-c n p") #'my/org-roam-find-project)
  (setq org-clock-sound "~/.emacs.d/isound.wav")

#+END_SRC

*** usage
- zettelcasten 방법을 사용
- *C-c n f* : 찾기 혹은 node 만들기
   capture buffer가 org node를 위해 만들어짐 다양한 템플릿을 지원하기 위해
- C-c C-c : 이 capture를 file에 저장
- C-c n i : 다른 롬 파일 링크 생성, 없는걸 만들면서 링크 생성할수도 있음
- *C-c n I* : 다른 롬 파일 링크 생성, 없는걸 만들면서 링크 생성하고 현버퍼에 있기
- *C-c n T* : 다른 롬 파일 링크 생성, 없는걸 만들면서 현버퍼에 있기
- C-M-i : title앞부분 입력후 이 키 입력시 링크가 바로 생성됨
- C-c n l : 파일 중간 부분 링크 생성 -> 헤딩 노드만 생성 M-x org-id-get-create 
- node에 alias추가 가능 : 헤더에 가서 M-x org-roam-alias-add 하면되고 여러개 추가도 가능
- C-c n b : backlink 나를 링크한곳 모아 보기 * org-roam * 이라는 이름의 버퍼에서 보여줌
- [[https://www.youtube.com/watch?v=YxgA5z2R08I][Capturing Youtube]]
- [[https://youtu.be/3-sLBaJAtew][Org Roam daily]] : *C-c n d n* : 새폴더 만들기
                   *C-c n d d* : 오늘 모은거 다보기
                   *C-c n d T* : 내일꺼 작성하기
                   *C-c n d Y* : 어제꺼 작성하기
                   *C-c n d G* : 특정일꺼 작성하기
                   *C-c n d t* : 내일 모은거 다보기
                   *C-c n d y* : 어제 모은거 다보기
                   *C-c n d G* : 특정일 모은거 다보기
                   *C-c n d b* : 현재파일 이전날 보기
                   *C-c n d f* : 현재파일 다음날 보기

* Terminal
** vterm
#+begin_src emacs-lisp
  (if (eq system-type 'darwin)
  (use-package vterm
    :commands vterm
    :config
    (setq vterm-max-scrollback 10000)))
  (if (eq system-type 'gnu/linux)
  (use-package vterm
    :commands vterm
    :load-path "~/.emacs.d/emacs-libvterm"
    :config
    (setq vterm-max-scrollback 10000)))
  (add-hook 'vterm-mode-hook 'evil-emacs-state)
#+end_src
