.emacs.d/init.org
** eshell
#+begin_src emacs-lisp
  (defun efs/configure-eshell()
    ;;save command history
    (add-hock 'eshell-pre-command-hook 'eshell-save-some-history)
    ;; truncate buffer for performance
    (add-to-list 'eshell-output-filter-functions 'eshell-truncate-buffers)
    (evil-define-key '(normal insert visual) eshell-mode-map (kbd "<home>") 'eshell-bol)
    (evil-normalize-keymaps)
    (setq eshell-history-size 10000
          eshell-buffer-maximum-lines 10000
          eshell-hist-ignoredups t
          eshell-scroll-to-bottom-on-input t))

  (use-package eshell-git-prompt)

  (use-package eshell
    :hook (eshell-first-time-mode . efs/configure-eshell)
    :config
    (eshell-git-prompt-use-theme 'powerline))
  
#+end_src

* 각종 팁
 - system-type변수에는 현재 환경이 windows인지 등이 나옴
 - package-refresh-contents : 패키지 없다고 할때 해주면 됨
   
* Windows and Frames

- A "window" is a region within an Emacs frame that shows a particular buffer
- A "frame" is an Emacs program window at the level of your OS or desktop environment which can hold multiple windows
- Multiple windows can show the same buffer, but with different scroll, selection, etc

Check out the Emacs manual entry for [[https://www.gnu.org/software/emacs/manual/html_node/emacs/Windows.html#Windows][Multiple Windows]]

* Basic Window Operations

Each item lists the default Emacs binding followed by the evil-mode binding.  Note that many of the evil-mode bindings also allow you to use Ctrl with the second key in the sequence!

| Command                             | Key   | Description                            |
|-------------------------------------+-------+----------------------------------------|
| =delete-window=                       | ~C-x 0~ | Close the current window               |
| =delete-other-windows=                | ~C-x 1~ | Close all other windows                |
| =split-window-below=                  | ~C-x 2~ | Split the current window horizonally   |
| =split-window-right=                  | ~C-x 3~ | Split the current window vertically    |
| =shrink-window-horizontally=          | ~C-x {~ | Make the window smaller horizontally   |
| =enlarge-window-horizontally=         | ~C-x }~ | Make the window bigger horizontally    |
| =shrink-window=                       | None! | Shrink the window vertically           |
| =shrink-window-if-larger-than-buffer= | ~C-x -~ | Shrink the window vertically to buffer |
| =balance-windows=                     | ~C-x +~ | Balance the sizes of all windows       |

*TIP*: You can use ~C-u~ (=universal-argument=) and a numeric prefix before running the =shrink= and =enlarge= commands to dictate the mount by which the window is resized.

** evil-mode alternatives

| Command                | Key        | Description                             |
|------------------------+------------+-----------------------------------------|
| =evil-window-delete=     | ~C-w C-c~    | Close the current window                |
| =delete-other-windows=   | ~C-w C-o~    | Close all other windows                 |
| =evil-window-split=      | ~C-w C-s~    | Split the current window horizontally   |
| =evil-window-vsplit=     | ~C-w C-v~    | Split the current window vertically     |
| =evil-window-set-width=  | ~C-w (pipe)~ | Use numeric prefix to set window width  |
| =evil-window-set-height= | ~C-w _~      | Use numeric prefix to set window height |
| =balance-windows=        | ~C-w =~      | Balance the sizes of all windows        |

*TIP*: You can use a numeric argument before running =evil-window-set-width= and =evil-window-set-height= to specify the desired size of the window.

** "Other window" operations

| Command                  | Keys      | Description                                      |
|--------------------------+-----------+--------------------------------------------------|
| =other-window=             | ~C-x o~     | Select the next visible window                   |
| =find-file-other-window=   | ~C-x 4 f~   | Open a file in another window                    |
| =dired-other-window=       | ~C-x 4 d~   | Open Dired in another window                     |
| =dired-jump-other-window=  | ~C-x 4 C-j~ | Open Dired in another window at location of file |
| =scroll-other-window=      | ~M-pgdn~    | Scroll the other window down without focusing it |
| =scroll-other-window-down= | ~M-pgup~    | Scroll the other window up without focusing it   |

*** evil-mode alternatives

| Command           | Keys    | Description                        |
|-------------------+---------+------------------------------------|
| =evil-window-next=  | ~C-w C-w~ | Select the next visible window     |
| =evil-window-prev=  | ~C-w W~   | Select the previous visible window |
| =ffap-other-window= | ~C-w C-f~ | Open a file in another window      |

**** More =other-window= commands

Learn about more =other-window= commands:

- Check out the ~C-x 4~ prefix with =which-key=!
- Also, use =counsel-M-x= and search for any commands with =other-window= in the name!

** Defaulting to vertical splits

You can default to vertical splits for "other windows" with the following config:

#+begin_src emacs-lisp

  (setq split-height-threshold nil)
  (setq split-width-threshold 0)

#+end_src

More information about controlling [[https://www.gnu.org/software/emacs/manual/html_node/elisp/Choosing-Window-Options.html][how buffers are displayed]] in the Emacs manual.

** Windmove for moving between windows

Windmove comes with Emacs, but is missing some features in Emacs 26.

- =windmove-up/down/left/right= - Focus the window next to the current in the specified direction
- =windmove-swap-states-up/down/left/right= - "Move" the current buffer to the window in the specified direction

*** evil-mode equivalents

evil-mode provides its own functions for moving between windows:

- =evil-window-left= - ~C-w h~
- =evil-window-right= - ~C-w l~
- =evil-window-up= - ~C-w k~
- =evil-window-down= - ~C-w j~

** buffer-move or moving buffers between windows

Use =buffer-move= for a more general solution:
buf-move한담에 방향키로 이동이 젤편

- =buf-move=: Turn on a mode where you can move the current buffer around with arrow keys, any other key finishes it
- =buf-move-left=
- =buf-move-right=
- =buf-move-up=
- =buf-move-down=

#+begin_src emacs-lisp

  (use-package buffer-move)

#+end_src

* winner-mode

=winner-mode= provides useful functions for undoing and redoing window configurations:

- =winner-undo= (~C-c left~ or ~C-w u~ bound below)
- =winner-redo= (~C-c right~ or ~C-w U~ bound below)

#+begin_src emacs-lisp

  (use-package winner-mode
    :ensure nil
    :bind (:map evil-window-map
           ("u" . winner-undo)
           ("U" . winner-redo))
    :config
    (winner-mode))

#+end_src

** Packages for moving between windows
*** ace-window
;윈도우 빠르게 이동, 윈도 마다 번호 매겨서 그 번호 누름 되게끔함
[[https://github.com/abo-abo/ace-window][ace-window]] makes it easy to jump between visible windows in your Emacs frame, just run the =ace-window= command and press the number displayed in the upper left corner of the window you want to switch to.  It also enables you to swap, delete, and move windows using similar functionality.

#+begin_src emacs-lisp

  (use-package ace-window)

#+end_src

Tip from *Cedrif Daf*: Set =aw-keys= to home-row keys for more convenience:

#+begin_src emacs-lisp

(setq aw-keys '(?a ?s ?d ?f ?g ?h ?j ?k ?l))

#+end_src

*** winum-mode
;현재 윈도에서 숫자로 이동 =C-x w 1=
This mode shows numbers in your windows' mode lines to tell you what keys you can press after using the key binding =C-x w=.  Check out the [[https://github.com/deb0ch/emacs-winum][winum-mode]] page for more useful tips!

#+begin_src emacs-lisp
  (use-package winum
    :config
    (winum-mode))
#+end_src


#+title: Unlock the Power of the Daemon with emacsclient

* What is the Emacs daemon?

Emacs can be run in a server mode:

- Pay Emacs startup cost only once per boot/login!
- Buffers persist across Emacs frames, can close Emacs window and reopen later
- Execute arbitrary commands and expressions from the command line

Manual:
https://www.gnu.org/software/emacs/manual/html_node/emacs/Emacs-Server.html#Emacs-Server

** Starting the daemon

The easiest way to get started is to use the following command inside of a running Emacs session

#+begin_src emacs-lisp

  ;; Enable server mode (daemon) for this Emacs session
  ;(server-start)

#+end_src

However, this is *very* different in practice than running Emacs as a real daemon!  We'll show why in a bit.

#+begin_src sh

  emacs --daemon

  # OR run as a foreground process (can be helpful to diagnose errors)

  emacs --fg-daemon

#+end_src

You can also have independent daemons:

#+begin_src sh

  # Start daemon named 'my-other-daemon'
  emacs --daemon=my-other-daemon

#+end_src

** Trying it out

Let's try running the Emacs daemon and see how it differs from running Emacs normally.

Run Emacs normally first to get a sense of the startup time.

#+begin_src sh

  emacs

#+end_src

Now run it as a daemon and notice how fast =emacsclient= creates a new frame:

#+begin_src sh

  emacs --fg-daemon

  emacsclient -c

#+end_src

Notice anything different about the UI?

*TIP*: You can find the list of active daemon names (sockets) by looking in the directory stored in the =server-socket-dir= variable in Emacs!

*** Killing the Emacs daemon

To kill the Emacs daemon, send the =(kill-emacs)= command to it:

#+begin_src sh

  emacsclient -e "(kill-emacs)"

#+end_src

** Using emacsclient

Manual:
https://www.gnu.org/software/emacs/manual/html_node/emacs/emacsclient-Options.html#emacsclient-Options

*** Important arguments

- ~-c~ / ~--create-frame~ - Create a new frame (don't pass this if you want to reuse the same open frame)
- ~-n~ / ~--no-wait~ - Don't wait for the Emacs frame to close
- ~-e~ / ~--eval~ - Evaluate an Emacs Lisp expression within the daemon
- ~-u~ / ~--suppress-output~ - Suppress output from Emacs (useful when running in a script)
- ~-s~ / ~--socket-name=name~ - Use a named daemon (=emacs --daemon=name=)
- ~-a~ / ~--alternate-editor=name~ - If Emacs daemon isn't running, use this command instead
- ~filename~ - Open a file in the current frame (or a new one if ~-c~ is passed)

*** Opening files from the command line

To open a new Emacs frame for a file without waiting for emacsclient to exit:

#+begin_src sh

  emacsclient -c -n ~/.emacs.d/Emacs.org

#+end_src

Set =EDITOR= to =emacsclient= in your shell's profile (=.bash_profile=, =.zsh_profile=, etc)

#+begin_src sh

  export EDITOR="emacsclient -c -a emacs"

#+end_src

Test this by using =git commit= (use ~C-x #~ to confirm your edit and close the frame!)

*** Evaluating expressions

This makes it easy to integrate other programs with Emacs!

#+begin_src sh

  emacsclient -e "(buffer-name)"

#+end_src

You can also run interactive commands to cause something to happen in the active Emacs frame:

#+begin_src sh

emacsclient -e "(counsel-switch-buffer)"

emacsclient -e "(read-string \"Enter a string: \")"

#+end_src

*** Automating Emacs in shell scripts

Example: [[file:~/.dotfiles/.bin/sync-dotfiles::emacsclient -u -e "(org-save-all-org-buffers)" -a "echo 'Emacs is not currently running'"][My =sync-dotfiles= script]] ([[https://github.com/daviwil/dotfiles/blob/master/.bin/sync-dotfiles#L15][Web]])

#+begin_src sh

  emacsclient -u -e "(org-save-all-org-buffers)" -a "echo 'Emacs is not currently running'"

#+end_src

*** Offloading tasks to another daemon

I don't necessarily recommend this approach, but it is possible!

#+begin_src emacs-lisp

  ;emacs --daemon=worker
  ;emacsclient -f worker -u -e "(org-babel-tangle-file \"~/.emacs.d/Emacs.org\")"

#+end_src

I'd recommend checking out the =async= package if you want to do things like this, though:

https://github.com/jwiegley/emacs-async/

We'll cover it in another video.


*** Running Emacs at Startup

Emacs comes with a =systemd= unit file:

#+begin_src sh

  sudo systemctl --user enable emacs

#+end_src

If you're allergic to =systemd= (or just want another way to run at login), you can possibly add it to the startup configuration for your desktop environment, profile script, etc.
* json Mode

#+BEGIN_SRC emacs-lisp
  (use-package json-mode
    :ensure t)
#+END_SRC

